import pyprojroot
import json

base_path = pyprojroot.find_root(pyprojroot.has_dir(".git"))

features = []

# 品詞のバイグラム
tags = ["名詞-普通名詞", "名詞-固有名詞", "名詞-数詞", "名詞-助動詞語幹", "代名詞", "形状詞-一般", "形状詞-タリ", "形状詞-助動詞語幹", "連体詞", "副詞", "接続詞", "感動詞-一般", "感動詞-フィラー", "動詞-一般", "動詞-非自立可能", "形容詞-一般", "形容詞-非自立可能", "助動詞", "助詞-格助詞", "助詞-副助詞", "助詞-係助詞", "助詞-接続助詞", "助詞-終助詞", "助詞-準体助詞", "接頭辞", "接尾辞-名詞的", "接尾辞-形状詞的", "接尾辞-動詞的", "接尾辞-形容詞的", "記号", "補助記号-句点", "補助記号-読点", "補助記号-括弧",  "空白"]
for tag1 in tags:
    for tag2 in tags:
        features.append(f"品詞のバイグラム ({tag1}, {tag2})")

# 助詞のバイグラム
zyoshi_list = {
    "助詞-格助詞": ["の", "に", "は", "を", "が", "と", "で", "から", "へ", "より"],
    "助詞-副助詞": ["か", "や", "など", "だけ", "って", "たり", "まで"],
    "助詞-係助詞": ["は", "も"],
    "助詞-接続助詞": ["て", "が", "と", "ば", "から", "けれど", "ながら"],
    "助詞-終助詞": ["か", "ね", "よ", "な"],
    "助詞-準体助詞": ["の"]
}
words = [f"{t}-{w}" for t, ws in zyoshi_list.items() for w in ws] # 31
for word1 in words:
    for word2 in words:
        features.append(f"助詞のバイグラム ({word1}, {word2})")

# 係り受けの特徴
types = ["高さ", "深さ", "距離", "分岐数"]
measures = ["最大値", "最小値", "平均値", "標準偏差"]
for type1 in types:
    for type2 in measures:
        features.append(f"係り受けの特徴 ({type1}-{type2})")

# 句読点の分布
for i in range(10):
    features.append(f"句読点の分布 ({i})")

# 機能語の使用頻度
kinougo_list_hiragana = ["の-助詞-格助詞", "に-助詞-格助詞", "て-助詞-接続助詞", "は-助詞-係助詞", "を-助詞-格助詞", "が-助詞-格助詞", "と-助詞-格助詞", "で-助詞-格助詞", "も-助詞-係助詞", "の-助詞-準体助詞", "から-助詞-格助詞", "が-助詞-接続助詞", "か-助詞-終助詞", "その-連体詞", "か-助詞-副助詞", "この-連体詞", "と-助詞-接続助詞", "や-助詞-副助詞", "ば-助詞-接続助詞", "から-助詞-接続助詞", "など-助詞-副助詞", "ね-助詞-終助詞", "よ-助詞-終助詞", "まで-助詞-副助詞", "へ-助詞-格助詞", "そう-副詞", "だけ-助詞-副助詞", "どう-副詞", "また-接続詞", "って-助詞-副助詞", "けれど-助詞-接続助詞", "な-助詞-終助詞", "たり-助詞-副助詞", "ながら-助詞-接続助詞", "しかし-接続詞", "より-助詞-格助詞", "し-助詞-接続助詞", "そして-接続詞", "もう-副詞", "こう-副詞", "ほど-助詞-副助詞", "くらい-助詞-副助詞", "および-接続詞", "よく-副詞", "おなじ-連体詞", "そんな-連体詞", "すこし-副詞", "あの-連体詞", "の-助詞-終助詞", "まだ-副詞", "やはり-副詞", "しか-助詞-副助詞", "わ-助詞-終助詞", "おおきな-連体詞", "ちょっと-副詞", "また-副詞", "まず-副詞", "すぐ-副詞", "とくに-副詞", "ばかり-助詞-副助詞", "どの-連体詞", "あるいは-接続詞", "たとえば-副詞", "こんな-連体詞", "なぜ-副詞", "まったく-副詞", "なんて-助詞-副助詞", "いちばん-副詞", "ある-連体詞", "もちろん-副詞", "あまり-副詞", "つまり-副詞", "もし-副詞", "わが-連体詞", "すでに-副詞", "さらに-副詞", "で-接続詞", "どんな-連体詞", "はじめて-副詞", "さらに-接続詞", "とても-副詞", "もっとも-副詞", "かなり-副詞", "もっと-副詞", "のみ-助詞-副助詞", "こそ-助詞-係助詞", "ただ-接続詞", "かならず-副詞", "しかも-接続詞", "さ-助詞-終助詞", "まあ-副詞", "つつ-助詞-接続助詞", "いろいろ-副詞", "ちいさな-連体詞", "さえ-助詞-副助詞", "ぞ-助詞-終助詞", "なお-接続詞", "ずっと-副詞", "なかなか-副詞", "ただし-接続詞", "ただ-副詞", "なんか-助詞-副助詞", "より-副詞", "すなわち-接続詞", "たくさん-副詞", "はっきり-副詞", "しっかり-副詞", "いわゆる-連体詞", "しばらく-副詞", "とも-助詞-接続助詞", "ずつ-助詞-副助詞", "ふたたび-副詞", "かつ-接続詞", "けっして-副詞", "まるで-副詞", "ゆっくり-副詞", "いっぽう-接続詞", "さて-接続詞", "むしろ-副詞", "けっこう-副詞", "いかに-副詞", "たぶん-副詞", "まさに-副詞", "きわめて-副詞", "おそらく-副詞", "やがて-副詞", "とにかく-副詞", "いったい-副詞", "ほぼ-副詞", "かつて-副詞", "きっと-副詞", "やら-助詞-副助詞", "ちょくせつ-副詞", "ちゃんと-副詞", "ぜひ-副詞", "よろしく-副詞", "い-助詞-終助詞", "とつぜん-副詞", "もしくは-接続詞", "ちょうど-副詞", "きちんと-副詞", "じゅうぶん-副詞", "たいへん-副詞", "いろんな-連体詞", "とうぜん-副詞", "もともと-副詞", "ぜんぜん-副詞", "にて-助詞-格助詞", "ようやく-副詞", "あらゆる-連体詞", "いっそう-副詞", "やっと-副詞", "けれど-接続詞", "とりあえず-副詞", "ついに-副詞", "やや-副詞", "どんどん-副詞", "が-接続詞", "さすが-副詞", "しも-助詞-副助詞", "かしら-助詞-終助詞", "もの-助詞-終助詞", "すっかり-副詞", "あらためて-副詞", "たとえ-副詞", "ずいぶん-副詞", "たんに-副詞", "ぜ-助詞-終助詞", "あくまで-副詞", "ますます-副詞", "じっと-副詞", "どうぞ-副詞", "すら-助詞-副助詞", "いきなり-副詞", "つぎつぎ-副詞", "いわば-副詞", "いまだ-副詞", "いくら-副詞", "ごく-副詞", "おもな-連体詞", "どころ-助詞-副助詞", "つい-副詞", "いっぱい-副詞", "まだまだ-副詞", "たって-助詞-接続助詞", "もはや-副詞", "いったん-副詞", "たっぷり-副詞", "なお-副詞", "きり-助詞-副助詞", "おなじく-副詞", "たまに-副詞", "しばしば-副詞", "わずか-副詞", "ともかく-副詞", "ふと-副詞", "いよいよ-副詞", "もっとも-接続詞", "おもに-副詞", "せっかく-副詞"]
for kinougo in kinougo_list_hiragana:
    features.append(f"機能語の使用頻度 ({kinougo})")
    
# 省略傾向
for obj in ["主語", "目的語"]:
    features.append(f"省略傾向 ({obj})")
    
with open(base_path/"src/misc/feature_names.json", "w") as f:
    json.dump(features, f, ensure_ascii=False, indent=2)